app/controllers/apps_users_controller.rb

  def index
    @apps_users = AppsUsers.all
---
SELECT * FROM `apps_users`