app/controllers/developers_controller.rb

SELECT * FROM `developers`
---
  def index
    @developers = Developers.all