app/controllers/friends_controller.rb

  def index
    @friends = Friend.all
---
SELECT * FROM `friends`