app/controllers/score_boards_controller.rb

SELECT * FROM `score_boards`
---
  def index
    @score_boards = ScoreBoard.all