app/controllers/users_controller.rb

SELECT * FROM `users`
---
  def index
  	@users = nil
  	if request.format.html? then
    	@users = User.all

INSERT INTO `users` (`updated_at`, `first_name`, `fb_id`, `last_name`, `email`, `created_at`) VALUES('2010-05-09 22:04:56', 'Felipe', 221469, 'Pimentel', 'fpimentel22@gmail.com', '2010-05-09 22:04:56')
---
  def create
  	@user = nil
  	success = false #default value
  	friends_list = nil
  	if request.format.html? then
    	@user = User.new(params[:user])
    	success = @user.save